package com.example.temuka.myawesomequizz;

public class Questions {

    public String mQuestion[]={
            "ყველაფერი, რაც სასიამოვნოა, სულაც არ არის სასარგებლო.\n" +
                    "ქვემოთ ჩამოთვლილთაგან რომელ დებულებას აქვს იგივე შინაარსი, რაც მოცემულს?",
            "წრიულ მოედანზე შადრევნის ირგვლივ ხუთი შენობა დგას: მუზეუმი სასტუმროს გვერდით დგას, ბიბლიოთეკა\n" +
                    "ეკლესიის გვერდით დგას, ეკლესია უნივერსიტეტის გვერდით დგას.\n" +
                    "\n" +
                    "ქვემოთ ჩამოთვლილთაგან რომელი შემთხვევაა შეუძლებელი?",
            "მოცემულია:\n" +
                    "\n" +
                    "\uF0B7 ყველა მუსიკოსს უყვარს პოეზია.\n" +
                    "თინამ დაასკვნა:\n" +
                    "\uF0B7 მაშასადამე, არსებობს ადამიანი, რომელსაც პოეზიაც უყვარს და სპორტიც.\n" +
                    "ქვემოთ ჩამოთვლილთაგან რომელი დებულება უნდა აეღო მას მეორე წანამძღვრად ამგვარი დასკვნის გამოსატანად?",
            "მოცემულია:\n" +
                    "\n" +
                    "\uF0B7 ყველა პლანეტა ვარსკვლავის გარშემო მოძრაობს.\n" +
                    "\uF0B7 ზოგიერთი ციური სხეული არ მოძრაობს ვარსკვლავის გარშემო." +
                    "ქვემოთ ჩამოთვლილთაგან რომელი დებულება არ შეიძლება იყოს ჭეშმარიტი, თუკი მოცემული დებულებები\n" +
                    "ჭეშმარიტია?",

    };

    private String mChoices[][] = {
            {"არსებობს სასარგებლო რამ, რაც სასიამოვნო არ არის.", "რაც სასარგებლო არ არის, ის არ არის სასიამოვნო.", "ზოგიერთი რამ, რაც სასიამოვნოა, არ არის სასარგებლო.", "რაც სასიამოვნოა, ის სასარგებლო არ არის."},
            {"სასტუმრო უნივერსიტეტის გვერდით დგას.", "უნივერსიტეტი მუზეუმის გვერდით დგას.", "ბიბლიოთეკა სასტუმროს გვერდით დგას.", "ბიბლიოთეკა უნივერსიტეტის გვერდით დგას."},
            {"სპორტის ზოგიერთი მოყვარული არ არის მუსიკოსი", "ზოგიერთი მუსიკოსი არ არის სპორტის მოყვარული.", "ზოგიერთი არამუსიკოსი არ არის სპორტის მოყვარული.", "ზოგიერთი მუსიკოსი სპორტის მოყვარულია."},
            {"ვარსკვლავის გარშემო მოძრავი ზოგიერთი ციური სხეული პლანეტაა.", "ყველა ციური სხეული, რომელიც ვარსკვლავის გარშემო არ მოძრაობს, პლანეტაა", "ზოგიერთი ციური სხეული, რომელიც პლანეტა არ არის, ვარსკვლავის გარშემო მოძრაობს.", "არც ერთი ციური სხეული, რომელიც პლანეტა არ არის, არ მოძრაობს ვარსკვლავის გარშემო."},


    };
    private String mCorrectAnwers[]= {"ზოგიერთი რამ, რაც სასიამოვნოა, არ არის სასარგებლო.", "ბიბლიოთეკა უნივერსიტეტის გვერდით დგას.", "ზოგიერთი მუსიკოსი სპორტის მოყვარულია.", "ყველა ციური სხეული, რომელიც ვარსკვლავის გარშემო არ მოძრაობს, პლანეტაა.", };
    public String getQuestion(int a){
        String question = mQuestion[a];
        return question;
    }
    public String getChoice1(int a){
        String choice = mChoices[a][0];
        return choice;
    }
    public String getChoice2(int a){
        String choice = mChoices[a][1];
        return choice;
    }
    public String getChoice3(int a){
        String choice = mChoices[a][2];
        return choice;
    }
    public String getChoice4(int a){
        String choice = mChoices[a][3];
        return choice;
    }

    public  String getCorrectAnswer(int a){
        String answer = mCorrectAnwers[a];
        return  answer;
    }
}
